По университетским стандартам дипломная записка -- основной продукт работы, а остальное, вроде, к примеру, кода, вторично.
Описание работы зачастую более важно, чем сама работа;

Записка представляет собой наиболее полный рассказ о вашей работе. Во многом повторяет презентацию, но намного полнее.
Содержит также информацию, которой в презентации нет;

Записка пишется в основном уже на практике в июне, ведь ей нужна финальная версия софта. Несмотря на это, откладывать на последний момент нельзя -- не успеете физически;


Объём записки -- 20+ страниц Ворда 12 кегля. Максимальный интервал -- 1.5;
Примерно пять страниц можно использовать на картинки;

Вся записка пишется по-русски связным и не перегруженным терминами текстом;

Содержание:
  1. Титульный лист;
    Учебное заведение;
    Год;
    Тема;
    Исполнитель;
    Заказчик;
    Консультант;

    Можно посмотреть записки прошлых лет и сделать по образу и подобию;

  2. Оглавление; (оно же -- содержание)
    Делается с помощью средств Ворда;

  3. Введение. Задача -- заинтересовать и в обшем объяснить, что вы делаете;
    Актаульность проблемы в общем случае;
    Потребнось;
    Причины выбора этой темы;

  Дальнейший порядок зависит от специфики задачи;

  4. Постановка задачи;
    2-3 страницы. Расписана хотя бы в виду User Stories. Включает в себя все функции системы;

  5. Актуальность и целевая аудитория;
    Не очень объёмно;

  6. Анализ предметной области и основные понятия;
    Вся дополнительная информация, необходимая для того чтобы было понятно. Своего рода справочник.

    Понятия вводятся не разом, а в момент, когда они необходимы для дальнейшего рассказа;
    Суммарно получится, скорее всего, несколько страниц;

  7. Обзор аналогов.
    Намного более подробный, чем в презентации;
    7.1. Описания и скриншоты каждой программы (в идеале -- от 3 до 7);
      Отсутствие аналогов недопустимо;
      Нужно также продемонстрировать, что вы покопались в теме прежде чем идти писать код;
    7.2. Сравнительная таблица как итог;
      При этом необязательно, чтобы вы везде превосходили конкурентов. Могут быть и минусы;

  8. Решение. Описывает то, как была решена /*или решается*/ задача. Главная часть записки и проектной работы в принципе. Занимает до 10 страниц;
    Теоретические выкладки;
      Форумлы, физические\химические термины и т.д.
    Алгоритмы;
    Технологии;
      Сокеты, микросервисы, ML и т.д.
      Описывается максимально подробно;
    Программная реализация;
      Языки, среды, библиотеки;

    9. Ход работы[, разделение труда];
      Описываются и тупиковые пути, и те, что привели к решению;
      Возникающие проблемы и их решения;

    10. Результат;
      Чего удалось достичь;
      Чего не удалось достичь и почему;
      [Использование на практике;]  //но если будет -- хорошо
      [Что было изучено;]

    11. Выводы;
      Ваши рефлексии на тему сделанного;

    12. Направление дальнейших разработок;
      12.5. Пример использования;
        Замена демонстрации. Стенограмма демонстрации со скриншотами;
        Займёт страницы 4;

    13. Литература/Источники;
      Указываются конкретные статьи на источниках;
      Википедия -- плохой истоник. То, на что ссылается Википедия -- хороший источник;

    Приложения;
      UML-диаграммы, не использованные ранее;
      Вся дополнительная информация;

    Приложение N2;
      Исходный код;
