                                  Дизайн-мышление; Эмпатия и фокусировка

Методика разработки проектов, нацеленная на получение идей от конкретной целевой аудитории на основе какой-то проблемы;

Неправильно выбранная аудитория может вести к провалу;

Необходимо:
  Глубокое погружение в опыт пользователя;
  Фокусировка на индивидуальных сценариях поведения и действиях;
  Экономичный и итерационный подход к разработке проектов;

Правила дизайн-мышления:
  "Правило полной корзины"
    Неиспользованные идеи -- это тоже хорошо, поток идей лишним не бывает;

  Надо учитывать мнения максимально широкого круга лиц компании с разных должностей;

  Главное мнение -- мнение пользователя. Надо погрузиться на его место и осознать его проблему, после чего думать о решениях, которые были бы приятны для пользователя;

  Работа в команде -- важная часть, так как разные люди с разными образами мышления дают больше информации;

  "Да, и" -- Нужно. Больше. Идей.

Процесс:
  Эмпатия -- погружение в опыт пользователя;
  Фокусировка -- сбор наблюдений предметной области;
  Генерация идей -- очевидно;
  Выбор идеи -- отбор лучших и наиболее реалистичных для воплощения в жизнь идей;
  Прототипирование -- начало разработки;
  Сбор обратной связи пользователей и, соответственно, улучшение продукта;


Эмпатия;
Основная задача -- сбор инфомрации об опыте пользователей;
Пользователя, как ни странно, надо слушать, чтобы осознать, что ему вообще надо. "Лишней" информации почти не бывает, так что надо собирать полную картину;

Есть несколько методов для этого:
  Мокасины. Постановка себя на место пользователя, осознание проблем на личном опыте;
  Карта стйекхолдеров. Попытка выделить людей, которые имеют отношение к проблеме;
