При защите проекта используется куча макулатуры.

Во-первых, сам проект -- приложение, или что вы там натворили;

Во-вторых, презентация, которая, по сути, оглавление для разговора, помогающая при выступлении;

И, наконец, самое объёмное -- дипломная записка, которая описывает вообще всё о проекте, занимает объём около 20 вордовских страниц и рассказывает вообще всё. Дипломная записка должна давать возможность человеку, который будет это читать, понять максимальное
количество информации о проекте. Записка ориентирована в основном на жюри конференций, а ещё -- для лицеистов следующих поколений, которые возьмут похожие темы. Им записка поможет что-то осознать, решить проблемы, с которыми вы встретились и так далее.
Ещё записку читает комиссия на защите, пусть и не очень подробно;
В университетских дипломах записка считается основной частью проекта;

Она делается долго и постоянно. Двадцать страниц текста печатаются два дня в любом случае. Части записки будут домашними заданиями. По сути, concept vision -- это начало записки, показывающее, что это, и зачем вам это нужно;
Это также станет первыми несколькими минутами доклада;
Худшим исходом будет, если у комиссии не появится понимания о том, что же человек, собственно, сделал. Они будут считать, что если они не поняли, произошло плохое объяснение. В этой части обязательно держать человека в интересе, и он обязан понять, что это,
и заинтересоваться. Всё должно быть, насколько возможно, просто и эффектно; Именно этот рассказ -- это concept vision;
