Один из самых факторов при выборе темы -- актуальность и новизна. Если нет аудитории, которой нужна плохая Visual Studio, вам не надо делать плохую Visual Studio;

Первый шаг -- посмотреть, кто делал что-то подобное до вас и чего он достиг. Надо быть уверенным в отсутствии изобретения велосипеда, и не существует ли уже проектов, которые реализуют вашу задачу;
Если такой аналог был найден, имеет смысл сменить тему, пусть, возомжно, и частично;
Главное -- не вбивать название темы в Гугл, а именно покопать на разных языках и формулировках, чтобы всё-таки что-то найти. Это важно, ведь проверить наличие аналогов -- самое простое, что можно использовать против вас;
Почти наверняка, такой продукт есть. Вопрос в том, почему он не выстрелил. Вам надо найти минусы в работах предшественников, исправить их и собрать таблицей. Одна ось -- конкурирующие продукты, вторая -- фишки;

Каждый продукт должен иметь USP -- unique selling proposition. В редких, но возможных ситуациях даже ухудшенные Эксели имеют право на существование;
