Грядут предзащиты. Несмотря на то, что они будут оценены, основная идей не в этом. После предзащиты каждому будут выданы замечания, которые и будут основным, что вы вынесете с презентации;
Несмотря на то, что у всех проекты разные, общая примерная структура доклада существует;


Всё должно быть целостным рассказом. Также надо помнить, что нет необходимости идеально следовать плану, его можно менять под себя;

Начнём с презентации. Она, что очевидно, состоит из слайнодв;
  I.
  1. Титульный слайд. Сверху справа написано "Лицей 1533" Его центр -- тема. Ниже написаны исполнители, заказчик, консультант и руководитель при наличии оных;
    О заказчике нужно дать то, что относится к теме проекта. Где он работает, чем занимается и так далее. Даже имя не особо важно;
  Затем идёт введение. Это пункт доклада, но не презентации. В нём надо рассказать:
    Почему вы выбрали эту тему?
    Почему она кажется интересной и перспективной?
  2. Общая формулировка, смысл и актуальность задачи такого типа;
    Речь здесь ведётся не о конкретно вашей теме, а о подбных задачах. Как и всегда, рассказ строится от общего к частному, и именно это общее тут и проявит себя;
    Слайд и рассказ в его время должен лаконично и логично перевести слушателя к конкретно вашей задаче;
    Сюда же включается то, откуда вылезла эта задача -- то, что ещё не сделано, и будет решено вашим проектом. Вы должны убедить всех в том, что вы улучшите ситуацию;
  //Начиная с этого момента порядок плохо определён
  3. Постановка задач и функции системы;
    Максимально конкретно -- "Я буду делать приложение, которое будет работать так-то". По сути, очень краткая выжимка из ТЗ;
  4. Обзор аналогов;
    Именно тут находится та самая таблица с плюсиками и минусиками;
  5. Анализ предметной области;     //Обычно -- самый сложный пункт. Может занимать до трёх слайдов;
    Он нужен, чтобы стало понятно, что вы вообще сотворили и в какой области. Если всё достаточно очевидно, он может идти почти в конце, но для чего-то более специфичного анализу придётся оказаться в начале, а то понять вас будет не так просто;
    Анализ не должен заваливать человека теорией. По-хорошему, понятия вводятся прямо по ходу, и находится везде в презентации. Когда вы вводите что-то новое, вы это объясняете;
    При этом надо не съехать в технические термины и программирование. Это нужно, но чуть позже. Весь доклад до пункта "решение" должен быть понятен кому угодно, кто случайно зайдёт в аудиторию;
    Предметных областей довольно часто бывает несколько. Зачастую, есть один большой и несколько чуть более мелких и технических;
    Здесь же где-то мелькает целевая аудитория. Она может оказаться примерно где угодно, но главное, чтобы выглядела органично. Если это где-нибудь затрагивается, можно это раскрутить;        //До этого надо дойти на первой предзащиты. Здесь задача, по сути, сформулирована;

На всей презенатции текст должен быть, но и перегибать с ним нельзя. Текст очень хорошо оформлять списками с пунктами, сплошным текстом будет грустно. Ну и, очевидно, он не должен повторять доклад;
Надо помнить о том, что всё показывавется с проектора, так что размер шрифта должен быть достаточно большим. При этом, не надо делать всё однотонным, ведь цветопередача будет страдать;

Также надо помнить, что от нас ждут достаточно формальной презентации, так что перегибать с креативом не надо;
  II. Решение задачи.  //конкретно такого заголовка нет. В этой части речь идёт про то, как мы делали с точки зрения программирования;
  6. Теоретические выкладки;
    -Формулы;
    -Законы наук;
  7. Алгоритмы;
  8. Программная реализация;
    То, что вы использвоали, чтобы создать своё нечто. Языки, библиотеки, IDE;
    Сюда же идёт архитектура проекта -- схемы с блоками, которы по-разному соединены;
  9. Ход работы;
    Идёт рассказ о том, что и как писалось, что ломалось, что не сломалось. Тут рассказывается также и то, что не вошло в проект -- языки, которые не подошли, к примеру;
  10. Результаты\выводы;
    Нужно указать, что из целей выполнено, а что -- нет;
    Нужно проанализировать, насколько у вас получилось выполнить задачу;
    Хорошим вариантом будет сбор отзывов после внедрения. Надо попробовать использовать проект по назначению, после чего провести разбор полётов. Именно он тут и нужен;
  11. Направления далььнейшей разработки;
    Что можно доделать, улучшить, переписать и так далее. Это может помочь как вам, так и потенциальным продолжателям вашего дела;
  12. Литература и источники;
    По сути, заменяет слайд "Спасибо за внимание". Там будет не вся литература, а только всё основное;

После этого всего счастья у нас начинается демонстрация проекта. Из этого следует пара мелочей. К примеру, нельзя использовать в презентации скриншоты, ведь вы их и так покажете;
