Очень важная часть проекта — перспективы дальнейшей разработки;
Платформа, на которую ты разрабатываешь, должна быть рядом с тобой;
Структура проекта тожу очень ценна;
Анализ предметной области — определение всех терминов, относящихся к теме;
Обзор аналогов — это обзор аналогов. С плюсами и минусами вашего проекта и аналогов;
Нужен слайд с указанными использованными программами, ЯП и так даллее;
Ход работы — слайд, показывающий ход работы. При работе вдвоём надо указывать, кто что делал;
Список литературы тоже нужен;

У проекта может быть куратор — человек, с которым вы консультиируетесь онлайн или ездите к ним очно;

А остальные 80 минут вещания Александра Владимировича я перессказывать не готов.
